snlkuharlocal/src/Documents/СписаниеКурсовыхРазниц/СписаниеКурсовыхРазниц.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document>
  <name>СписаниеКурсовыхРазниц</name>
  <registerRecords>AccumulationRegister.ВзаиморасчетыПоДокументамРасчетов</registerRecords>
  <registerRecords>AccumulationRegister.Затраты</registerRecords>
  <registerRecords>AccumulationRegister.ДенежныеСредства</registerRecords>
  <registerRecords>AccumulationRegister.Взаиморасчеты</registerRecords>
  <attributes>
    <name>Автор</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
</mdclass:Document>

snlkuharlocal/src/AccumulationRegisters/Взаиморасчеты/Взаиморасчеты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Взаиморасчеты</name>
  <resources>
    <name>СуммаВал</name>
    <comment>Сумма в рублях</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <comment>Сумма в валюте расчетов</comment>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>КодОперации</name>
    <type>
      <types>EnumRef.КодыОперацийОстатки</types>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Дата_НачалаЗадолженности</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Документ_ЗакрытогоПериода</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>100</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>УИД_СтрокиПлатежа</name>
    <type>
      <types>UUID</types>
    </type>
  </attributes>
  <dimensions>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/Затраты/Затраты.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>Затраты</name>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>ДатаЗаписи</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </attributes>
  <attributes>
    <name>Контрагент</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>КонтрагентЛогистика</name>
    <type>
      <types>CatalogRef.Подразделения</types>
      <types>CatalogRef.Контрагенты</types>
    </type>
  </attributes>
  <attributes>
    <name>Автомобиль</name>
    <type>
      <types>CatalogRef.Автомобили</types>
    </type>
  </attributes>
  <attributes>
    <name>КаналСбыта</name>
    <type>
      <types>CatalogRef.КаналСбыта</types>
    </type>
  </attributes>
  <dimensions>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СтатьяЗатрат</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </dimensions>
  <dimensions>
    <name>КапитальныеЗатраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </dimensions>
  <dimensions>
    <name>СубЗатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/AccumulationRegisters/ДенежныеСредства/ДенежныеСредства.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
  <name>ДенежныеСредства</name>
  <resources>
    <name>Сумма</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <resources>
    <name>СуммаУпр</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </resources>
  <attributes>
    <name>СтатьяДДС</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправитель</name>
    <type>
      <types>CatalogRef.ФизическиеЛица</types>
      <types>CatalogRef.Кассы</types>
      <types>String</types>
      <types>CatalogRef.Контрагенты</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВалютаДокумента</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>СуммаДокумента</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>19</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Договор</name>
    <type>
      <types>CatalogRef.Договоры</types>
    </type>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <type>
      <types>CatalogRef.Подразделения</types>
    </type>
  </attributes>
  <attributes>
    <name>ПериодРасходов</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Проект</name>
    <type>
      <types>CatalogRef.Проекты</types>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Субзатрата</name>
    <type>
      <types>CatalogRef.СубЗатраты</types>
    </type>
  </attributes>
  <dimensions>
    <name>БанковскийСчет</name>
    <type>
      <types>CatalogRef.Кассы</types>
      <types>CatalogRef.БанковскиеСчета</types>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </dimensions>
  <dimensions>
    <name>Валюта</name>
    <type>
      <types>CatalogRef.Валюты</types>
    </type>
  </dimensions>
</mdclass:AccumulationRegister>

snlkuharlocal/src/Catalogs/СтатьиЗатрат/СтатьиЗатрат.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СтатьиЗатрат</name>
  <hierarchical>true</hierarchical>
  <predefined>
    <items>
      <name>ВводОстатков</name>
      <description>Ввод остатков</description>
    </items>
    <items>
      <name>Выручка</name>
      <description>Выручка</description>
    </items>
    <items>
      <name>Конвертация</name>
      <description>Конвертация</description>
    </items>
    <items>
      <name>КурсовыеРазницыКредиторскаяЗадолженность</name>
      <description>Курсовые разницы кред. задолженность</description>
    </items>
    <items>
      <name>КурсовыеРазницыДС</name>
      <description>Курсовые разницы по ДС</description>
    </items>
    <items>
      <name>КурсовыеРазницыПоКредитамИЗаймам</name>
      <description>Курсовые разницы по кредитам и займам</description>
    </items>
    <items>
      <name>НедостачаПоМашине</name>
      <description>Недостача по машине</description>
    </items>
    <items>
      <name>Нераспределено</name>
      <description>Нераспределено</description>
    </items>
    <items>
      <name>ПриходОтПокупателейПК</name>
      <description>Приход от покупателей (ПК)</description>
    </items>
    <items>
      <name>Транзит</name>
      <description>Транзит</description>
    </items>
  </predefined>
  <attributes>
    <name>СчетУчета</name>
    <type>
      <types>ChartOfAccountsRef.Хозрасчетный</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто1</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто2</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>Субконто3</name>
    <type>
      <types>Characteristic.ВидыСубконтоХозрасчетные</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДДС_Бух</name>
    <type>
      <types>CatalogRef.СтатьиЗатрат</types>
    </type>
  </attributes>
  <attributes>
    <name>ВключатьВБюджет</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Знак</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>10</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Бухгалтерская</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>Затраты</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ДДС</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

snlkuharlocal/src/Documents/СписаниеКурсовыхРазниц/ObjectModule.bsl
Процедура ОбработкаПроведения(Отказ, РежимПроведения)
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
	
	ЦО = Справочники.Подразделения.НайтиПоКоду("SSP-0001");
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	Контрагент,
	|	Договор,
	|	Договор.ВидДоговора_Новый.СтатьяЗатратКР КАК СтатьяЗатратКР,
	|	СуммаВалОстаток КАК СумВал,
	|	СуммаУпрОстаток	КАК СумУпр,
	|	Договор.ВалютаКредита КАК ВалютаРасчетов
	|ИЗ
	|	РегистрНакопления.Взаиморасчеты.Остатки(&Дата2) КАК ВзаиморасчетыОстатки";
		
	Запрос.УстановитьПараметр("Дата2",МоментВремени());
	
	ВалютаУпр	=ПараметрыСеанса.ВалютаУпр_2009;
	КурсУпр		=ПолучитьКурсВалюты_ПоРусски(ВалютаУпр,Дата);
	
	КэшКурсов=Новый Соответствие;
	
	Сч=0;	
	
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВалютаРасчетов	= ?(ЗначениеЗаполнено(Выборка.ВалютаРасчетов),Выборка.ВалютаРасчетов,ПараметрыСеанса.ВалютаНац);
		Курс			= КэшКурсов.Получить(ВалютаРасчетов);
		
		Если Курс=Неопределено Тогда
			Курс=ПолучитьКурсВалюты_ПоРусски(ВалютаРасчетов,Дата);		
			КэшКурсов.Вставить(ВалютаРасчетов,Курс);
		КонецЕсли;
		
		КурсоваяРазница=Выборка.СумУпр-глПересчет(Выборка.СумВал,ВалютаРасчетов,Курс,ВалютаУпр,КурсУпр);
		
		Если КурсоваяРазница<>0 Тогда
			//Взаиморасчеты
			Движение=Движения.Взаиморасчеты.Добавить();
			
			Движение.Период		=Дата;
			
			Движение.ВидДвижения=ВидДвиженияНакопления.Расход;
			Движение.Контрагент	=Выборка.Контрагент;
			Движение.Договор	=Выборка.Договор;	
			
			Движение.СуммаУпр	=КурсоваяРазница;					
			
			Если ЗначениеЗаполнено(Выборка.СтатьяЗатратКР) Тогда
				СтатьяЗатрат	=Выборка.СтатьяЗатратКР;							
			Иначе
				СтатьяЗатрат	=Справочники.СтатьиЗатрат.КурсовыеРазницыКредиторскаяЗадолженность;										
			КонецЕсли;			
			Движение.СтатьяДДС	=СтатьяЗатрат;
			
			//Затраты
			Движение=Движения.Затраты.Добавить();	
			Движение.Период			=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.СтатьяЗатрат	=СтатьяЗатрат;
			Движение.СуммаУпр		=КурсоваяРазница;
			//крохин начало
			Движение.Подразделение = ЦО;
			//крохин конец
			Движение.Контрагент		=Выборка.Контрагент;
			Движение.Договор		=Выборка.Договор;
		//крохин начало
		Движение.Комментарий        = "списание курсовых разниц";
		//крохин конец

		КонецЕсли;
	КонецЦикла; 
	
	Запрос=Новый Запрос;
	Запрос.Текст="
	|ВЫБРАТЬ
	|	БанковскийСчет,	
	|	СуммаОстаток 			КАК СумВал,
	|	СуммаУпрОстаток			КАК СумУпр,
	|	Валюта				 	КАК ВалютаРасчетов
	|ИЗ
	|	РегистрНакопления.ДенежныеСредства.Остатки(&Дата2,)";
	
	Запрос.УстановитьПараметр("Дата2",МоментВремени());
	Выборка=Запрос.Выполнить().Выбрать();
	Пока Выборка.Следующий() Цикл
		ВалютаРасчетов	= ?(ЗначениеЗаполнено(Выборка.ВалютаРасчетов),Выборка.ВалютаРасчетов,ПараметрыСеанса.ВалютаНац);
		Курс			= КэшКурсов.Получить(ВалютаРасчетов);
		
		Если Курс=Неопределено Тогда
			Курс=ПолучитьКурсВалюты_ПоРусски(ВалютаРасчетов,Дата);		
			КэшКурсов.Вставить(ВалютаРасчетов,Курс);
		КонецЕсли;
		
		КурсоваяРазница=Выборка.СумУпр-глПересчет(Выборка.СумВал,ВалютаРасчетов,Курс,ВалютаУпр,КурсУпр);
		
		Если КурсоваяРазница<>0 Тогда
			Движение=Движения.ДенежныеСредства.Добавить();
			Движение.Период		=Дата;
			
			Движение.ВидДвижения	=ВидДвиженияНакопления.Расход;
			
			Движение.БанковскийСчет	=Выборка.БанковскийСчет;
			Движение.Валюта			=Выборка.ВалютаРасчетов;	
			
			Движение.СтатьяДДС		=Справочники.СтатьиЗатрат.КурсовыеРазницыДС;
			
			Движение.СуммаУпр		=КурсоваяРазница;		
			
			Движение=Движения.Затраты.Добавить();	
			Движение.Период			=Дата;
			Движение.ВидДвижения	=ВидДвиженияНакопления.Приход;
			
			Движение.СтатьяЗатрат	=Справочники.СтатьиЗатрат.КурсовыеРазницыДС;
			Движение.СуммаУпр		=КурсоваяРазница;
		   //крохин начало
			Движение.Подразделение = ЦО;
			//крохин конец
		//крохин начало
		Движение.Комментарий        = "списание курсовых разниц";
		//крохин конец

			
			Движение.Контрагент		=Выборка.БанковскийСчет;			
		КонецЕсли;	
	КонецЦикла;	
КонецПроцедуры

Процедура ОбработкаУдаленияПроведения(Отказ)
	//+++Чирков Свертка. НИЧЕГО НЕ ВСТАВЛЯТЬ ПЕРЕД ЭТОЙ СТРОКОЙ !!!
	Если ПараметрыСеанса.СверткаБазы Тогда Возврат КонецЕсли;
	//---Чирков Свертка.
	
	//++Ратманов управляемые блокировки
	Если НЕ ПроведениеС.БлокировкаПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	Если НЕ ПроведениеС.КонтрольПоОбъекту(Ссылка) Тогда  
		Отказ = Истина;
		Возврат;
	КонецЕсли;	
	//--Ратманов управляемые блокировки
КонецПроцедуры
